# coding=utf-8
'''
与前端耦合的中间件
'''
import sys

reload(sys)
sys.setdefaultencoding('utf-8')


class WebFormat(object):
	cities = {
		'北京': ['朝阳区', '海淀区', '通州区', '房山区', '丰台区', '昌平区', '大兴区', '顺义区', '西城区', '延庆县', '石景山区', '宣武区', '怀柔区', '崇文区', '密云县',
			   '东城区', '平谷区', '门头沟区'],
		'天津': ['和平区', '北辰区', '河北区', '河西区', '西青区', '津南区', '东丽区', '武清区', '宝坻区', '红桥区', '静海县', '宁河县', '蓟州区', '滨河新区', '南开区',
			   '河东区'],
		'河北': ['石家庄', '唐山', '秦皇岛', '邯郸', '邢台', '保定', '张家口', '承德', '沧州', '廊坊', '衡水', '定州', '辛集'],
		'山西': ['太原', '大同', '阳泉', '长治', '晋城', '朔州', '晋中', '运城', '忻州', '临汾', '吕梁'],
		'内蒙古': ['赤峰', '包头', '通辽', '呼和浩特', '鄂尔多斯', '乌海', '呼伦贝尔', '兴安盟', '巴彦淖尔盟', '乌兰察布', '锡林郭勒盟', '阿拉善盟'],
		'辽宁': ['沈阳', '大连', '鞍山', '抚顺', '本溪', '丹东', '锦州', '营口', '阜新', '辽阳', '盘锦', '铁岭', '朝阳', '葫芦岛'],
		'吉林': ['长春', '通化', '白山', '延边朝鲜族自治区', '白城', '吉林', '松原', '辽源', '四平', '梅河口'],
		'黑龙江': ['哈尔滨', '齐齐哈尔', '鸡西', '鹤岗', '双鸭山', '大庆', '伊春', '佳木斯', '七台河', '牡丹江', '黑河', '绥化', '大兴安岭地区'],
		'上海': ['松江区', '宝山区', '金山区', '嘉定区', '青浦区', '浦东新区', '奉贤区', '徐汇区', '闵行区', '黄浦区', '杨浦区', '虹口区', '普陀区', '长宁区', '崇明区',
			   '静安区'],
		'江苏': ['南京', '无锡', '徐州', '常州', '苏州', '南通', '连云港', '淮安', '盐城', '扬州', '镇江', '泰州', '宿迁'],
		'浙江': ['杭州', '宁波', '温州', '绍兴', '湖州', '嘉兴', '金华', '衢州', '台州', '丽水', '舟山'],
		'安徽': ['合肥', '芜湖', '蛙埠', '淮南', '马鞍山', '淮北', '铜陵', '安庆', '黄山', '阜阳', '宿州', '滁州', '六安', '宣城', '池州', '亳州'],
		'贵州': ['贵阳', '黔东南苗族侗族自治区', '黔南布依族苗族自治区', '遵义', '黔西南布依族苗族自治区', '毕节', '铜仁', '安顺', '六盘水'],
		'宁夏': ['银川', '吴忠', '中卫', '石嘴山', '固原'],
		'福建': ['厦门', '福州', '泉州', '莆田', '漳州', '宁德', '南平', '三明', '龙岩'],
		'江西': ['南昌', '九江', '上饶', '抚州', '宜春', '吉安', '赣州', '景德镇', '萍乡', '新余', '鹰潭'],
		'山东': ['济南', '青岛', '淄博', '枣庄', '东营', '烟台', '潍坊', '济宁', '泰安', '威海', '日照', '滨州', '德州', '聊城', '临沂', '菏泽', '莱芜'],
		'河南': ['郑州', '开封', '洛阳', '平顶山', '安阳', '鹤壁', '新乡', '焦作', '濮阳', '许昌', '漯河', '三门峡', '商丘', '周口', '驻马店', '南阳', '信阳',
			   '济源'],
		'湖北': ['武汉', '黄石', '十堰', '宜昌', '襄阳', '鄂州', '荆门', '孝感', '荆州', '黄冈', '咸宁', '随州', '恩施土家族苗族自治区', '仙桃', '潜江', '天门',
			   '神农架林区'],
		'湖南': ['长沙', '株洲', '湘潭', '衡阳', '邵阳', '岳阳', '常德', '张家界', '益阳', '娄底', '郴州', '永州', '怀化', '湘西土家族苗族自治区'],
		'广东': ['东莞', '广州', '中山', '深圳', '惠州', '江门', '珠海', '汕头', '佛山', '湛江', '河源', '肇庆', '清远', '潮州', '韶关', '揭阳', '阳江',
			   '梅州', '云浮', '茂名', '汕尾'],
		'广西': ['贵港', '玉林', '北海', '南宁', '柳州', '桂林', '梧州', '钦州', '来宾', '河池', '百色', '贺州', '崇左', '防城港'],
		'海南': ['三亚', '海口', '琼海', '文昌', '东方', '昌江黎族自治县', '陵水黎族自治县', '乐东黎族自治县', '保亭黎族苗族自治县', '五指山', '澄迈县', '万宁', '儋州',
			   '临高县', '白沙黎族自治县', '定安县', '琼中黎族苗族自治县', '屯昌县'],
		'重庆': ['渝中区', '沙坪坝区', '江北区', '南岸区', '大渡口区', '九龙坡区', '巴南区', '渝北区', '北碚区', '永川区', '江津区', '合川区', '双桥区', '万盛区',
			   '南川区', '涪陵区', '长寿区', '潼南区', '铜梁区', '大足区', '荣昌区', '璧山区', '綦江区', '万州区', '城口县', '巫溪县', '巫山县', '开州区', '云阳县',
			   '奉节县', '梁平区', '忠县', '垫江县', '丰都县', '黔江区', '秀山土家族苗族自治县', '酉阳土家族苗族自治县县', '石柱土家族自治县', '彭水苗族土家族自治县', '武隆区'],
		'四川': ['成都', '绵阳', '广元', '达州', '南充', '德阳', '广安', '阿坝藏族羌族自治州', '巴中', '遂宁', '内江', '凉山彝族自治州', '攀枝花', '乐山', '自贡',
			   '泸州', '雅安', '宜宾', '资阳', '眉山', '甘孜藏族自治州'],
		'甘肃': ['兰州', '天水', '庆阳', '武威', '酒泉', '张掖', '陇南地区', '白银', '定西地区', '平凉', '嘉峪关', '临夏回族自治州', '金昌', '甘南州'],
		'云南': ['昆明', '红河哈尼族彝族自治州', '大理白族自治州', '文山壮族苗族州', '德宏傣族景颇族州', '曲靖', '昭通', '楚雄彝族自治州', '保山', '玉溪', '丽江地区', '临沧地区',
			   '思茅地区', '西双版纳傣族自治州', '怒江傈僳族自治州', '迪庆藏族自治州'],
		'西藏': ['拉萨', '山南', '林芝', '日喀则', '阿里地区', '昌都', '那曲地区'],
		'陕西': ['西安', '宝鸡', '咸阳', '渭南', '铜川', '延安', '榆林', '安康', '汉中', '商洛'],
		'青海': ['西宁', '海西蒙古族藏族自治州', '海东', '海北藏族自治州', '果洛藏族自治州', '玉树藏族自治州', '黄南藏族自治州', '海南藏族自治州'],
		'新疆': ['乌鲁木齐', '克拉玛依', '吐鲁番地区', '哈密', '昌吉回族自治州', '博尔塔拉蒙古自治州', '巴音郭楞蒙古自治州', '阿克苏地区', '克孜勒苏柯尔克孜自治州', '喀什地区',
			   '和田地区', '伊犁哈萨克自治州', '塔城地区', '阿勒泰地区', '石河子', '阿拉尔', '图木舒克', '五家渠', '北屯', '铁门关', '双河', '可克达拉', '昆玉']
		}

	# 将过短的市级地里位置转换
	def short2qianduan(self, province, city):
		citylst = self.cities[province]
		if citylst is None:
			return None
		for c in citylst:
			if city in c:
				return c

	# 将过长的市级地里位置转换
	def long2qianduan(self, province, city):
		citylst = self.cities[province]
		if citylst is None:
			return None
		for c in citylst:
			if c in city:
				return c

	def is_dun(self, city, s):
		return city.find(s)

	def change_city(self, province, city):
		if(city=="北京" or city=="天津" or city=="上海" or city=="重庆" or city=="" or city=="香港" or city=="澳门" or province=="台湾"):
			return city
		else:
			if (self.is_dun(city, '、') != -1):
				t1 = city.split('、')[0]
				t2 = city.split('、')[1]
				tt1 = self.short2qianduan(province, t1)
				tt2 = self.short2qianduan(province, t2)
				if (tt1 and tt2):
					ci = tt1 + "、" + tt2
					return ci
				elif (tt1):
					ci = tt1
					return ci
				else:
					ci = tt2
					return ci
			else:
				if(self.short2qianduan(province,city)):
					return self.short2qianduan(province,city)

if __name__ == '__main__':
	l = WebFormat()
	city ="红河哈尼族彝族"
	province = "云南"
	try:
		print l.change_city(province, city)
		print province
	except Exception, e:
		print e

